tudouzhuang/Robocup_re/stm32test/Core/Inc/ssd1306.h
/**
 * This Library was originally written by Olivier Van den Eede (4ilo) in 2016.
 * Some refactoring was done and SPI support was added by Aleksander Alekseev (afiskon) in 2018.
 *
 * https://github.com/afiskon/stm32-ssd1306
 */
#include "main.h"
#define STM32F1
#ifndef __SSD1306_H__
#define __SSD1306_H__
#define SSD1306_USE_SPI  hspi1
#define SSD1306_USE_DMA
//#define SSD1306_USE_I2C	hi2c1

#if defined(STM32F1)
#include "stm32f1xx_hal.h"

#elif defined(STM32F4)
#include "stm32f4xx_hal.h"
#else
#error "SSD1306 library was tested only on STM32F1 and STM32F4 MCU families. Please modify ssd1306.h if you know what you are doing. Also please send a pull request if it turns out the library works on other MCU's as well!"
#endif

#include "ssd1306_fonts.h"

/* vvv I2C config vvv */
#if defined(SSD1306_USE_I2C)
#ifndef SSD1306_I2C_PORT
#define SSD1306_I2C_PORT		hi2c1
#endif

#ifndef SSD1306_I2C_ADDR
#define SSD1306_I2C_ADDR        (0x3C << 1)
#endif

/* ^^^ I2C config ^^^ */

/* vvv SPI config vvv */

#elif defined(SSD1306_USE_SPI)
#define OLED_RES_Pin 			 GPIO_PIN_6
#define OLED_RES_GPIO_Port	 	 GPIOA
#define OLED_SCK_Pin 			 GPIO_PIN_5
#define OLED_SCK_GPIO_Port		 GPIOA
#define OLED_DC_Pin				 GPIO_PIN_4
#define OLED_DC_GPIO_Port 		 GPIOA
#define OLED_MOSI_Pin 		     GPIO_PIN_7
#define OLED_MOSI_GPIO_Port		 GPIOA
#define OLED_CS_Pin 		     GPIO_PIN_3
#define OLED_CS_GPIO_Port 		 GPIOA

#ifndef SSD1306_SPI_PORT
#define SSD1306_SPI_PORT        SSD1306_USE_SPI
#endif

#ifndef SSD1306_CS_Port
#define SSD1306_CS_Port         OLED_CS_GPIO_Port
#endif
#ifndef SSD1306_CS_Pin
#define SSD1306_CS_Pin          OLED_CS_Pin
#endif

#ifndef SSD1306_DC_Port
#define SSD1306_DC_Port         OLED_DC_GPIO_Port
#endif
#ifndef SSD1306_DC_Pin
#define SSD1306_DC_Pin          OLED_DC_Pin
#endif

#ifndef SSD1306_Reset_Port
#define SSD1306_Reset_Port      OLED_RES_GPIO_Port
#endif
#ifndef SSD1306_Reset_Pin
#define SSD1306_Reset_Pin       OLED_RES_Pin
#endif
#endif
///* ^^^ SPI config ^^^ */

#if defined(SSD1306_USE_I2C)
extern I2C_HandleTypeDef SSD1306_I2C_PORT;
#elif defined(SSD1306_USE_SPI)
extern SPI_HandleTypeDef SSD1306_SPI_PORT;
#else
#error "You should define SSD1306_USE_SPI or SSD1306_USE_I2C macro!"
#endif

// SSD1306 LCD height in pixels
#ifndef SSD1306_HEIGHT
#define SSD1306_HEIGHT          64
#endif

// SSD1306 width in pixels
#ifndef SSD1306_WIDTH
#define SSD1306_WIDTH           128
#endif

// some LEDs don't display anything in first two columns
// #define SSD1306_WIDTH           130

// Enumeration for screen colors
typedef enum {
    Black = 0x00, // Black color, no pixel
    White = 0x01  // Pixel is set. Color depends on LCD
} SSD1306_COLOR;

// Struct to store transformations
typedef struct {
    uint16_t CurrentX;
    uint16_t CurrentY;
    uint8_t Inverted;
    uint8_t Initialized;
} SSD1306_t;

// Procedure definitions
void ssd1306_Init(void);
void ssd1306_Fill(SSD1306_COLOR color);
void ssd1306_UpdateScreen(void);
void ssd1306_DrawPixel(uint8_t x, uint8_t y, SSD1306_COLOR color);
char ssd1306_WriteChar(char ch, FontDef Font, SSD1306_COLOR color);
char ssd1306_WriteString(char* str, FontDef Font, SSD1306_COLOR color);
void ssd1306_SetCursor(uint8_t x, uint8_t y);

// Low-level procedures
void ssd1306_Reset(void);
void ssd1306_WriteCommand(uint8_t byte);
void ssd1306_WriteData(uint8_t* buffer, size_t buff_size);

#endif // __SSD1306_H__
